Public Attributes | List of all members
API_ViewOptions Struct Reference
Project Navigator
Describes various display output options. More...
#include <APIdefs_ViewSettings.hpp>
 Public Attributes
API_ModelViewOptions  | modelViewOpt
View options which have effect on both the display and on various outputs.
API_OnScreenViewOptions  | onScreenViewOpt
View options which have effect on the display only.
Int32  | filler [4]
Detailed Description
Describes various display output options.
Remarks
Call the ACAPI_Navigator_GetViewOptions or the ACAPI_Navigator_ChangeViewOptions functions to operate on this data.
Member Data Documentation
◆ filler
 Int32 API_ViewOptions::filler[4]
◆ modelViewOpt
 API_ViewOptions::modelViewOpt
View options which have effect on both the display and on various outputs.
◆ onScreenViewOpt
 API_ViewOptions::onScreenViewOpt
View options which have effect on the display only.